# <center> CCT College Dublin </center>

## <center> Assessment Cover Page</center>

<p style="font-size:larger; text-align:center; color:red;"><em>
To be provided separately as a word doc for students to include with every submission
</em></p>

<br><br><br>
---

<span style="font-size:larger;">

**Module Title:**&nbspStatistical Techniques for Data Analysisa Preparation
**Assessment Title:**&nbsp;& Statistical Techniques p;David McQuaid
**Student Full Name:**&nbsp;&nbsp;&nbsp;Yumiko Maria Bejarano Azogue 
**Student Number:**&nbsp;&nbsp;&nbsp;2024144
**Assessment Due Date:**21st April 2024bsp;5th April 2024 23:59
**Date of Submission:*21st April 2024 2024bsp;&nbsp;5/04/2024
</span> 

<br><br><br>

---

#### Declaration 

```
By submitting this assessment, I confirm that I have read the CCT policy on Academic Misconduct and understand the implications of submitting work that is not my own or does not appropriately reference material taken from a third party or other source. I declare it to be my own work and that all material from third parties has been appropriately referenced. I further confirm that this work has not previously been submitted for assessment by myself or someone else in CCT College Dublin or any other higher education institution.
```
<br><br><br>

# Observing and describing data

## Characterisation of the data set:

In [1]:
#Libraries and summary
import pandas as pd
import numpy as np

In [2]:
# Import thi slibrary to suppress the warnings
import warnings
# The object 'warnings' is used to call the method 'filterwarnings' and ignore the warnings
warnings.filterwarnings('ignore')

In [3]:
# Loading the data into the data frame
df = pd.read_csv("DEA04.20240415011714.csv") # df=dataframe

# Data Description: 
Begin by describing the dataset, including its size, structure, and variables. This involves examining the types of variables (numeric or categorical), their distributions, and any missing or erroneous values.

In [4]:
# To display the top 5 rows
df.head()

,STATISTIC,Statistic Label,TLIST(A1),Year,C02199V02655,Sex,C02076V02508,Age Group,UNIT,VALUE
0,DEA04C01,Mean Annual Earnings,2011,2011,1,Male,310,15 - 24 years,Euro,18900.0
1,DEA04C01,Mean Annual Earnings,2011,2011,1,Male,320,15 years and over,Euro,45781.0
2,DEA04C01,Mean Annual Earnings,2011,2011,1,Male,410,25 - 29 years,Euro,31135.0
3,DEA04C01,Mean Annual Earnings,2011,2011,1,Male,445,30 - 39 years,Euro,44439.0
4,DEA04C01,Mean Annual Earnings,2011,2011,1,Male,480,40 - 49 years,Euro,55690.0

In [5]:
# To display the bottom 5 rows
df.tail()

,STATISTIC,Statistic Label,TLIST(A1),Year,C02199V02655,Sex,C02076V02508,Age Group,UNIT,VALUE
499,DEA04C03,Percentage of Employments,2022,2022,2,Female,410,25 - 29 years,%,48.3
500,DEA04C03,Percentage of Employments,2022,2022,2,Female,445,30 - 39 years,%,47.4
501,DEA04C03,Percentage of Employments,2022,2022,2,Female,480,40 - 49 years,%,49.1
502,DEA04C03,Percentage of Employments,2022,2022,2,Female,520,50 - 59 years,%,49.8
503,DEA04C03,Percentage of Employments,2022,2022,2,Female,560,60 years and over,%,48.2

In [6]:
# Print the dataset size
print("Dataset Size:", df.shape)

(504, 10)

In [7]:
# Print the data structure (data types of columns)
print('Datatype in Each Column\n')
pd.DataFrame(df.dtypes, columns=['Datatype']).rename_axis("Column_Name")

Datatype in Each Column

                Datatype
Column_Name
STATISTIC         object
Statistic Label   object
TLIST(A1)          int64
Year               int64
C02199V02655       int64
Sex               object
C02076V02508       int64
Age Group         object
UNIT              object
VALUE            float64

In [8]:
# Information about the dataframe
print("\nInformation about the dataframe:")
df.info()

Information about the dataframe:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 504 entries, 0 to 503
Data columns (total 10 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   STATISTIC        504 non-null    object
 1   Statistic Label  504 non-null    object
 2   TLIST(A1)        504 non-null    int64
 3   Year             504 non-null    int64
 4   C02199V02655     504 non-null    int64
 5   Sex              504 non-null    object
 6   C02076V02508     504 non-null    int64
 7   Age Group        504 non-null    object
 8   UNIT             504 non-null    object
 9   VALUE            504 non-null    float64
dtypes: float64(1), int64(4), object(5)
memory usage: 39.5+ KB

In [9]:
df.nunique()

STATISTIC            3
Statistic Label      3
TLIST(A1)           12
Year                12
C02199V02655         2
Sex                  2
C02076V02508         7
Age Group            7
UNIT                 2
VALUE              390
dtype: int64

In [13]:
# Print descriptive statistics for numerical variables
df.describe().T

,count,mean,std,min,25%,50%,75%,max
TLIST(A1),504.0,2016.500000,3.455482,2011.0,2013.75,2016.5,2019.25,2022.0
Year,504.0,2016.500000,3.455482,2011.0,2013.75,2016.5,2019.25,2022.0
C02199V02655,504.0,1.500000,0.500497,1.0,1.00,1.5,2.00,2.0
C02076V02508,504.0,435.000000,88.283836,310.0,320.00,445.0,520.00,560.0
VALUE,504.0,24342.586706,19515.499556,44.8,51.10,29461.5,39312.75,67392.0

In [21]:
# Print the number of missing values in each column
print("Missing Values:\n", df.isnull().sum())

Missing Values:
 STATISTIC          0
Statistic Label    0
TLIST(A1)          0
Year               0
C02199V02655       0
Sex                0
C02076V02508       0
Age Group          0
UNIT               0
VALUE              0
dtype: int64

# Summary Statistics: 
Calculate descriptive statistics for numerical variables (e.g., mean, median, standard deviation) and frequency tables for categorical variables. 

This provides an initial understanding of the data's central tendencies and variability.

In [18]:
#  Statistical information of Dataframe
df.describe().T.style.bar(subset=['mean'], color='#205ff2').background_gradient(subset=['std'], cmap='Reds').background_gradient(subset=['50%'], cmap='coolwarm')

In [23]:
# Summary Statistics
# Print descriptive statistics for numerical variables
print("Descriptive Statistics for Numerical Variables:\n" )
df.describe()

Descriptive Statistics for Numerical Variables:

         TLIST(A1)         Year  C02199V02655  C02076V02508         VALUE
count   504.000000   504.000000    504.000000    504.000000    504.000000
mean   2016.500000  2016.500000      1.500000    435.000000  24342.586706
std       3.455482     3.455482      0.500497     88.283836  19515.499556
min    2011.000000  2011.000000      1.000000    310.000000     44.800000
25%    2013.750000  2013.750000      1.000000    320.000000     51.100000
50%    2016.500000  2016.500000      1.500000    445.000000  29461.500000
75%    2019.250000  2019.250000      2.000000    520.000000  39312.750000
max    2022.000000  2022.000000      2.000000    560.000000  67392.000000

In [24]:
# Identify categorical variables
print("Frequency Tables for Categorical Variables:\n")
df.describe(include=object).T

Frequency Tables for Categorical Variables:

                count unique                   top freq
STATISTIC         504      3              DEA04C01  168
Statistic Label   504      3  Mean Annual Earnings  168
Sex               504      2                  Male  252
Age Group         504      7         15 - 24 years   72
UNIT              504      2                  Euro  336

In [14]:
df['Statistic Label'].unique()

array(['Mean Annual Earnings', 'Median Annual Earnings',
       'Percentage of Employments'], dtype=object)

In [15]:
df['Sex'].unique()

array(['Male', 'Female'], dtype=object)

In [16]:
df['Age Group'].unique()

array(['15 - 24 years', '15 years and over', '25 - 29 years',
       '30 - 39 years', '40 - 49 years', '50 - 59 years',
       '60 years and over'], dtype=object)

# Pre-processing

# Handling Missing Values: 
Address any missing data by imputation or removal, depending on the extent and nature of the missingness.

In [26]:
# Handling Missing Values
# Drop rows with missing values
print("Missing Values:\n", df.isnull().sum().sum())

Missing Values:
 0

# Encoding Categorical Variables: 
Convert categorical variables into a numerical format suitable for analysis, such as one-hot encoding or label encoding.

In [ ]:
# Encoding Categorical Variables
# Perform one-hot encoding for categorical variables

df_encoded = pd.get_dummies(df, columns=['category'])

# Normalization/Standardization: 
Scale numerical features to a similar range to prevent variables with larger magnitudes from dominating the analysis.

In [ ]:
# Normalization/Standardization
# Scale numerical features to a similar range using StandardScaler
from sklearn.preprocessing import StandardScaler
scaler = StandardScaler()
df_scaled = scaler.fit_transform(df[['numerical_column']])



â€¢